avr-rust/avrd/packs/atmega/ATmega1281.atdf
        <module name="TC8">
          <instance name="TC0" caption="Timer/Counter, 8-bit">
            <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data" caption="Timer/Counter, 8-bit"/>
            <signals>
              <signal group="T" function="default" pad="PD7"/>
              <signal group="OCB" function="default" pad="PG5"/>
              <signal group="OCA" function="default" pad="PB7"/>
            </signals>
          </instance>
        </module>
        <module name="TC8_ASYNC">
          <instance name="TC2" caption="Timer/Counter, 8-bit Async">
            <register-group name="TC2" name-in-module="TC2" offset="0x00" address-space="data" caption="Timer/Counter, 8-bit Async"/>
            <signals>
              <signal group="TOSC" index="1" function="default" pad="PG4"/>
              <signal group="TOSC" index="2" function="default" pad="PG3"/>
              <signal group="OCA" function="default" pad="PB4"/>
            </signals>
          </instance>
        </module>
        <module name="WDT">
          <instance name="WDT" caption="Watchdog Timer">
            <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data" caption="Watchdog Timer"/>
          </instance>
        </module>
        <module name="TC16">
          <instance name="TC5" caption="Timer/Counter, 16-bit">
            <register-group name="TC5" name-in-module="TC5" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
          </instance>
          <instance name="TC4" caption="Timer/Counter, 16-bit">
            <register-group name="TC4" name-in-module="TC4" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
          </instance>
          <instance name="TC3" caption="Timer/Counter, 16-bit">
            <register-group name="TC3" name-in-module="TC3" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
            <signals>
              <signal group="T" function="default" pad="PE6"/>
              <signal group="ICP" function="default" pad="PE7"/>
              <signal group="OCA" function="default" pad="PE3"/>
              <signal group="OCB" function="default" pad="PE4"/>
              <signal group="OCC" function="default" pad="PE5"/>
            </signals>
          </instance>
          <instance name="TC1" caption="Timer/Counter, 16-bit">
            <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
            <signals>
              <signal group="T" function="default" pad="PD6"/>
              <signal group="ICP" function="default" pad="PD4"/>
              <signal group="OCA" function="default" pad="PB5"/>
              <signal group="OCB" function="default" pad="PB6"/>
              <signal group="OCC" function="default" pad="PB7"/>
            </signals>
          </instance>
        </module>
        <module name="EEPROM">
          <instance name="EEPROM" caption="EEPROM">
            <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data" caption="EEPROM"/>
          </instance>
        </module>
        <module name="JTAG">
          <instance name="JTAG" caption="JTAG Interface">
            <register-group name="JTAG" name-in-module="JTAG" offset="0x00" address-space="data" caption="JTAG Interface"/>
            <signals>
              <signal group="TCK" function="default" pad="PF4"/>
              <signal group="TMS" function="default" pad="PF5"/>
              <signal group="TDO" function="default" pad="PF6"/>
              <signal group="TDI" function="default" pad="PF7"/>
            </signals>
          </instance>
        </module>
        <module name="EXINT">
          <instance name="EXINT" caption="External Interrupts">
            <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data" caption="External Interrupts"/>
            <signals>
              <signal group="PCINT" index="0" function="default" pad="PB0"/>
              <signal group="PCINT" index="1" function="default" pad="PB1"/>
              <signal group="PCINT" index="2" function="default" pad="PB2"/>
              <signal group="PCINT" index="3" function="default" pad="PB3"/>
              <signal group="PCINT" index="4" function="default" pad="PB4"/>
              <signal group="PCINT" index="5" function="default" pad="PB5"/>
              <signal group="PCINT" index="6" function="default" pad="PB6"/>
              <signal group="PCINT" index="7" function="default" pad="PB7"/>
              <signal group="PCINT" index="8" function="default" pad="PE0"/>
              <signal group="INT" index="0" function="default" pad="PD0"/>
              <signal group="INT" index="1" function="default" pad="PD1"/>
              <signal group="INT" index="2" function="default" pad="PD2"/>
              <signal group="INT" index="3" function="default" pad="PD3"/>
              <signal group="INT" index="4" function="default" pad="PE4"/>
              <signal group="INT" index="5" function="default" pad="PE5"/>
              <signal group="INT" index="6" function="default" pad="PE6"/>
              <signal group="INT" index="7" function="default" pad="PE7"/>
            </signals>
          </instance>
        </module>
        <module name="ADC">
          <instance name="ADC" caption="Analog-to-Digital Converter">
            <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data" caption="Analog-to-Digital Converter"/>
            <signals>
              <signal group="ADC" index="0" function="default" pad="PF0"/>
              <signal group="ADC" index="1" function="default" pad="PF1"/>
              <signal group="ADC" index="2" function="default" pad="PF2"/>
              <signal group="ADC" index="3" function="default" pad="PF3"/>
              <signal group="ADC" index="4" function="default" pad="PF4"/>
              <signal group="ADC" index="5" function="default" pad="PF5"/>
              <signal group="ADC" index="6" function="default" pad="PF6"/>
              <signal group="ADC" index="7" function="default" pad="PF7"/>
            </signals>
          </instance>
        </module>
